<?php return [

    '-fun' => [

        'inflect' => [
            'x.toUpperCase()=="ЧЕГО?"', // родительный падеж
            '1',                        // именительный падеж; "что?"
        ],
        
        'byNum' => [
            '!((x%100)>10&&(x%100)<20)&&(x%10)==1',             // кот
            '!((x%100)>10&&(x%100)<20)&&(x%10)>=2&&(x%10)<=4',  // кота
            '1',                                                // котов
        ],
        
        'byAge' => [
            'x<=10',
            'x>10 && x<=18',
            '1',
        ],
        
        'byGender' => [
            'x && x.toUpperCase()=="MALE"',
            'x && x.toUpperCase()=="FEMALE"',
            '1', // default
        ],
        
        'byWeight' => [
            'weight/height/height*100*100<18.5',
            'x1/x2/x2*100*100>=18.5 && x1/x2/x2*100*100<25',
            'x1/x2/x2*100*100>=25 && x1/x2/x2*100*100<30',
            '1',
        ],

    ],

    '' => [
        'welcome'   => 'Добро пожаловать на демо-страницу JaroshJS-l10n',
        'today'     => 'Сегодня',
        'month_01'  => [['inflect:ask','Января','Январь']],
        'month_02'  => [['inflect:ask','Февраля','Февраль']],
        'month_03'  => [['inflect:ask','Марта','Март']],
        'month_04'  => [['inflect:ask','Апреля','Апрель']],
        'month_05'  => [['inflect:ask','Мая','Май']],
        'month_06'  => [['inflect:ask','Июня','Июнь']],
        'month_07'  => [['inflect:ask','Июля','Июль']],
        'month_08'  => [['inflect:ask','Августа','Август']],
        'month_09'  => [['inflect:ask','Сентября','Сентябрь']],
        'month_10'  => [['inflect:ask','Октября','Октябрь']],
        'month_11'  => [['inflect:ask','Ноября','Ноябрь']],
        'month_12'  => [['inflect:ask','Декабря','Декабрь']],
    ],

    'TestPage' => [
        'smb_wrote_you' => [
            [
                'byWeight:weight:height',
                ['byGender:gender','тощий','тощая','тощий'],
                ['byGender:gender','стройный','стройная','стройный'],
                ['byGender:gender','полный','полная','полный'],
                ['byGender:gender','тучный','тучная','тучный']
            ],
            ' ',
            [
                'byGender:gender',
                ['byAge:age','мальчик','юноша','мужчина'],
                ['byAge:age','девочка','девушка','женщина'],
                'человек'
            ],
            ' ',
            ['byGender:gender','отправил','отправила','отправил'], 
            ' вам ',
            ['num'],
            ' ',
            ['byNum:num','сообщение','сообщения','сообщений']
        ],
    ],

];
